### Exercici 1 #

A partir dels documents adjunts (estructura i dades), crea una base de dades amb MySQL. Mostra les característiques principals de l'esquema creat i explica les diferents taules i variables que hi ha.

In [2]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in /Users/ullaaller/opt/anaconda3/lib/python3.8/site-packages (8.0.31)
Requirement already satisfied: protobuf<=3.20.1,>=3.11.0 in /Users/ullaaller/opt/anaconda3/lib/python3.8/site-packages (from mysql-connector-python) (3.20.1)

In [3]:
import mysql.connector

In [4]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="Ona_mauro1012"
)

print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x7f7da967c730>

In [40]:
## CREAR una base de datos

import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  passwd="Ona_mauro1012",
  
)

mycursor = mydb.cursor()

sql = "CREATE DATABASE movies"

mycursor.execute(sql)

In [37]:
## MOSTRAR las bases de datos 
    
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="Ona_mauro1012"
)

mycursor = mydb.cursor()

mycursor.execute("SHOW DATABASES")

for x in mycursor:
  print(x)

('information_schema',)
('movies',)
('mydatabase',)
('mysql',)
('performance_schema',)
('sys',)

 ## Eliminar una base de datos
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  passwd="Ona_mauro1012",
  database="movies"
)

mycursor = mydb.cursor()

sql = "DROP DATABASE movies"

mycursor.execute(sql)

## Eliminar una tabla
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  passwd="Ona_mauro1012",
  database="movies"
)

mycursor = mydb.cursor()

sql = "DROP TABLE tb_person"

mycursor.execute(sql)

In [48]:
## Crear una tabla

import mysql.connector
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="Ona_mauro1012",
  database="movies"
)

mycursor = mydb.cursor()

mycursor.execute("CREATE TABLE movies.tb_genre \
                (genre_id        INTEGER NOT NULL ,\
  genre_name       CHARACTER VARYING(40) NOT NULL ,\
  created_by_user  CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD' ,\
  created_date     DATE ,\
  updated_date     DATE ,\
  CONSTRAINT pk_genre PRIMARY KEY (genre_id))")



print(mycursor.rowcount, "Se ha creado la tabla movies.tb_genre")

0 Se ha creado la tabla movie.tb_genre

In [1]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  passwd="Ona_mauro1012",
  database="movies"
)

mycursor = mydb.cursor()

mycursor.execute ("INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 1, 'Acción')")
mycursor.execute ("INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 2, 'Ciencia Ficción')")
mycursor.execute ("INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 3, 'Comedia')")
mycursor.execute ("INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 4, 'Drama')")
mycursor.execute ("INSERT INTO movies.tb_genre (genre_id, genre_name, created_by_user) VALUES ( 5, 'Fantasía', 'apermag')")
mycursor.execute ("INSERT INTO movies.tb_genre (genre_id, genre_name, created_by_user, created_date, updated_date) VALUES ( 6, 'Melodrama', 'apermag', '2018-09-01', '2018-09-27')")
mycursor.execute ("INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 7, 'Musical')")
mycursor.execute ("INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 8, 'Romance')")
mycursor.execute ("INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 9, 'Suspense')")
mycursor.execute ("INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES (10, 'Terror')")
mycursor.execute ("INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES (11, 'Bélico')")



print(mycursor.rowcount, "Se han insertado los datos a  la tabla movies.tb_genre")

1 Se han insertado los datos a  la tabla movies.tb_genre

In [50]:

import mysql.connector
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="Ona_mauro1012",
  database="movies"
)

mycursor = mydb.cursor()

mycursor.execute("CREATE TABLE tb_movie \
                 (movie_id         INTEGER NOT NULL ,\
                 movie_title      CHARACTER VARYING(100) NOT NULL ,\
                  movie_date       DATE ,\
                  movie_format     CHARACTER VARYING(50) ,\
                  movie_genre_id   INTEGER ,\
                  created_by_user  CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD' ,\
                created_date     DATE ,\
                  updated_date     DATE ,\
              CONSTRAINT pk_movie PRIMARY KEY (movie_id) ,\
              CONSTRAINT fk_movie_genre FOREIGN KEY (movie_genre_id) REFERENCES movies.tb_genre (genre_id))")


print(mycursor.rowcount, "Se ha creado la tabla tb_movie")

0 Se ha creado la tabla tb_movie

In [3]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="Ona_mauro1012",
  database="movies"
)

mycursor = mydb.cursor()

mycursor.execute("SHOW TABLES")

for x in mycursor:
  print(x)

('tb_genre',)
('tb_movie',)

In [10]:
import mysql.connector
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="Ona_mauro1012",
  database="movies"
)

mycursor = mydb.cursor()

mycursor.execute("CREATE TABLE movies.tb_role\
(role_id          INTEGER NOT NULL ,\
  role_name        CHARACTER VARYING(60) NOT NULL ,\
  created_by_user  CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD' ,\
  created_date     DATE ,\
  updated_date     DATE ,\
  CONSTRAINT pk_role PRIMARY KEY (role_id))")


print(mycursor.rowcount, "Se ha creado la tabla movies.tb_role")

0 Se ha creado la tabla movies.tb_role

In [12]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  passwd="Ona_mauro1012",
  database="movies"
)

mycursor = mydb.cursor()


mycursor.execute ("INSERT INTO movies.tb_role (role_id, role_name) VALUES ( 1, 'Actor')")
mycursor.execute ("INSERT INTO movies.tb_role (role_id, role_name) VALUES ( 2, 'Director')")
mycursor.execute ("INSERT INTO movies.tb_role (role_id, role_name) VALUES ( 3, 'Productor')")
mycursor.execute ("INSERT INTO movies.tb_role (role_id, role_name) VALUES ( 4, 'Guionista')")
mycursor.execute ("INSERT INTO movies.tb_role (role_id, role_name) VALUES ( 5, 'Música')")


print(mycursor.rowcount, "Se han insertado los datos a la tabla movies.tb_role")

1 Se han insertado los datos a la tabla movies.tb_role

In [18]:
import mysql.connector
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="Ona_mauro1012",
  database="movies"
)

mycursor = mydb.cursor()

mycursor.execute("CREATE TABLE movies.tb_person\
(person_id        INTEGER NOT NULL ,\
  person_name      CHARACTER VARYING(100) NOT NULL ,\
  person_country   CHARACTER VARYING(40) , \
  person_dob       DATE NOT NULL ,\
  person_dod       DATE ,\
  person_parent_id INTEGER ,\
  created_by_user  CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD' ,\
  created_date     DATE ,\
  updated_date     DATE ,\
  CONSTRAINT pk_person PRIMARY KEY (person_id) ,\
  CONSTRAINT fk_person_parent FOREIGN KEY (person_parent_id) REFERENCES movies.tb_person (person_id))")


print(mycursor.rowcount, "Se ha creado la tabla tb_person")

0 Se ha creado la tabla tb_person

In [19]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  passwd="Ona_mauro1012",
  database="movies"
)

mycursor = mydb.cursor()


mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 1, 'Francis Ford Coppola', 'United States', '1939-04-07', NULL, NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 2, 'Carmine Coppola', 'United States', '1945-07-08', NULL, NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 3, 'Marlon Brando', 'United States', '1924-04-03', '2004-07-01', NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 4, 'Robert Duvall', 'United States', '1931-01-05', NULL, NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 5, 'Martin Sheen', 'United States', '1940-08-03', NULL, NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 6, 'Harrison Ford', 'United States', '1942-07-13', NULL, NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 7, 'George Lucas', 'United States', '1944-05-14', NULL, NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 8, 'Gary Kurtz', 'United States', '1940-07-27', NULL, NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 9, 'Steven Spielberg', 'United States', '1946-12-18', NULL, NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (10, 'John Williams', 'United States', '1928-08-08', NULL, NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (11, 'Tom Hanks', 'United States', '1956-07-09', NULL, NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (12, 'Catherine Zeta-Jones', 'Wales', '1969-09-25', NULL, NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (13, 'Alfred Joseph Hitchcock', 'United Kingdom', '1899-08-13', '1980-04-29', NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (14, 'Anthony Perkins', 'United States', '1934-04-04', '1992-09-08', NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (15, 'Vera Miles', 'United States', '1929-08-23', NULL, NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (16, 'Emilio Martinez Lazaro', 'Spain', '1956-09-09', NULL, NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (17, 'Dani Rovira', 'Spain', '1984-07-01', NULL, NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (18, 'Clara Lago', 'Spain', '1986-04-17', NULL, NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (19, 'Carmen Machi', 'Spain', '1964-08-09', NULL, NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (20, 'Karra Elejalde', 'Spain', '1960-03-06', NULL, NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (21, 'Daniel Sanchez Arevalo', 'Spain', '1970-06-08', NULL, NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (22, 'Quim Gutierrez', 'Spain', '1981-03-27', NULL, NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (23, 'Robert Alamo', 'Spain', '1970-05-06', NULL, NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (24, 'Hector Colome', 'Spain', '1944-10-25', '2015-02-28', NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (25, 'Veronica Echegui', 'Spain', '1983-03-14', NULL, NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (26, 'Patrick Criado', 'Spain', '1995-09-23', NULL, NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (27, 'Sean Connery', 'Scotland', '1930-07-08', NULL, NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (28, 'Mel Gibson', 'Australia', '1950-08-09', NULL, NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (29, 'Morgan Freeman', 'United States', '1935-10-01', NULL, NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (30, 'Tim Robbins', 'United States', '1949-06-07', NULL, NULL)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (41, 'Charlie Sheen', 'United States', '1965-09-03', NULL, 5)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (42, 'Emilio Estevez', 'United States', '1962-05-12', NULL, 5)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (43, 'Ramón Estevez', 'United States', '1963-08-07', NULL, 5)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (44, 'Reneé Estevez', 'United States', '1967-04-02', NULL, 5)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (45, 'Paula Speert Sheen', 'United States', '1986-01-06', NULL,41)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (46, 'Bob Sheen', 'United States', '2009-05-01', NULL,41)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (47, 'Max Sheen', 'United States', '2009-05-01', NULL,41)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (48, 'Sam Sheen', 'United States', '2004-03-09', NULL,41)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (49, 'Lola Sheen', 'United States', '2005-06-01', NULL,41)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (50, 'Paula Jones-Sheen', 'United States', '2003-07-06', NULL,45)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (51, 'Paloma Rae Estevez', 'United States', '1986-02-15', NULL,42)")
mycursor.execute ("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (52, 'Taylor Levi Estevez', 'United States', '1984-06-22', NULL,42)")



print(mycursor.rowcount, "Se han insertado los datos a la tabla tb_person")

1 Se han insertado los datos a la tabla tb_person

In [20]:
import mysql.connector
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="Ona_mauro1012",
  database="movies"
)

mycursor = mydb.cursor()

mycursor.execute("CREATE TABLE movies.tb_movie_person \
                 (movie_id         INTEGER NOT NULL ,\
  person_id        INTEGER NOT NULL ,\
  role_id          INTEGER NOT NULL ,\
  movie_award_ind  CHAR(1) NOT NULL ,\
  created_by_user  CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD' ,\
  created_date     DATE ,\
  updated_date     DATE ,\
  CONSTRAINT pk_movper PRIMARY KEY (movie_id, person_id, role_id) ,\
  CONSTRAINT fk_movper_movie FOREIGN KEY (movie_id) REFERENCES movies.tb_movie (movie_id) ,\
  CONSTRAINT fk_movper_person FOREIGN KEY (person_id) REFERENCES movies.tb_person (person_id) ,\
  CONSTRAINT fk_movper_role FOREIGN KEY (role_id) REFERENCES movies.tb_role (role_id))")

print(mycursor.rowcount, "Se ha creado la tabla tb_movie_person")

0 Se ha creado la tabla tb_movie_person